thule2510ddt/STM32_Bootloader_CAN_SPI_I2C_UART_GPIO/Drivers/stm32f4xx_drivers/Test/GPIO_BUTTON.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stm32f411xx.h>

int main(void){
	GPIO_Handle_t LED_0;
	LED_0.GPIOx = GPIOD;
	LED_0.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_15;
	LED_0.GPIO_PinConfig.GPIO_PinMode = GPIO_OUTPUT_MODE;
	HAL_GPIO_Init(&LED_0);

	GPIO_Handle_t LED_1;
	LED_1.GPIOx = GPIOD;
	LED_1.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_14;
	LED_1.GPIO_PinConfig.GPIO_PinMode = GPIO_OUTPUT_MODE;
	HAL_GPIO_Init(&LED_1);

	GPIO_Handle_t LED_2;
	LED_2.GPIOx = GPIOD;
	LED_2.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_13;
	LED_2.GPIO_PinConfig.GPIO_PinMode = GPIO_OUTPUT_MODE;
	HAL_GPIO_Init(&LED_2);

	GPIO_Handle_t LED_3;
	LED_3.GPIOx = GPIOD;
	LED_3.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_12;
	LED_3.GPIO_PinConfig.GPIO_PinMode = GPIO_OUTPUT_MODE;
	HAL_GPIO_Init(&LED_3);

	GPIO_Handle_t BTN;
	BTN.GPIOx = GPIOA;
	BTN.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_0;
	BTN.GPIO_PinConfig.GPIO_PinMode = GPIO_INPUT_MODE;
	BTN.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PD;
	HAL_GPIO_Init(&BTN);
	while(true){
		if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0)){
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
			for(int i = 0; i < 500000; i++){
				// wait
			}
		}
	}
	return 0;
}
